Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: 1: Uses a simpler method to determine OutputVarControl.
ja: 1：OutputVarControlを決定するために、より単純な方法を使用します。

source: 1 (true) or Wait:
ja: 1（true）またはWait：

source: 1 (true): Include subsequently-executed lines in the history.
ja: 1 (true)：その後に実行された行を履歴に含めます。

source: 2. You may modify your copy or copies of the Program or any portion of it, thus forming a work based on the Program, and copy and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions:
ja: 2.あなたは、『プログラム』の複製物やその一部を改変し、『プログラム』に基づ く著作物を形成し、そのような改変や著作物を上記第1項の条件の下で複製・頒 布することができます：

source: 2: Default behavior.
ja: 2：デフォルトの動作。

source: 2: Path Must Exist
ja: 2：パスは存在しなければならない

source: 2: Stores the control's HWND in OutputVarControl rather than the control's ClassNN.
ja: 2：コントロールのClassNNではなく、コントロールのHWNDを OutputVarControlに格納します。

source: 2: The same as mode 1 above except that the limitation is absent.
ja: 2：限定がないことを除き、上記モード1と同じです。

source: 3. You may copy and distribute the Program (or a work based on it, under Section 2) in object code or executable form under the terms of Sections 1 and 2 above provided that you also do one of the following:
ja: 3.あなたは、上記第1項および第2項の条件の下で、『プログラム』(あるいはそれを基にした第2項の著作物)をオブジェクトコードあるいは実行形式で複製し頒布することができる。ただし、以下のいずれかを行うことを条件とする：

source: 32: Shortcuts (.lnk files) are selected as-is rather than being resolved to their targets.
ja: 32：ショートカット（.lnkファイル）は、ターゲットに解決されるのではなく、そのまま選択されます。

source: 3: A window's title must exactly match WinTitle to be a match.
ja: 3：ウィンドウのタイトルはWinTitleと完全に一致しなければならない。

source: 4. You may not copy, modify, sublicense, or distribute the Program except as expressly provided under this License.
ja: 4.あなたは、本使用許諾の下で明示的に提供されている場合を除き、『プログラム』を複製、変更、サブライセンス、または頒布することはできません。

source: 5. You are not required to accept this License, since you have not signed it.
ja: 5.あなたは本許諾書に署名していないため、本許諾書を受諾する必要はありません。

source: 6. Each time you redistribute the Program (or any work based on the Program), the recipient automatically receives a license from the original licensor to copy, distribute or modify the Program subject to these terms and conditions.
ja: 6.あなたが『プログラム』(あるいは『プログラム』を基にした作品)を再頒布す るたびに、受領者は自動的に元のライセンス許諾者から、これらの条項と条件に 従い『プログラム』を複製、頒布、改変するライセンスを受領することになりま す。

source: 7-zip Error: Use 7-zip or a compatible program to extract the setup files from the installer EXE, then run setup.exe or Installer.ahk (drag and drop Installer.ahk onto AutoHotkeyU32.exe).
ja: 7-zipのエラー：7-zipまたは互換性のあるプログラムを使用して、インストーラEXEからセットアップファイルを抽出し、setup.exeまたはInstaller.ahk（Installer.ahkをAutoHotkeyU32.exeにドラッグ＆ドロップ）を実行します。

source: 7. If, as a consequence of a court judgment or allegation of patent infringement or for any other reason (not limited to patent issues), conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License.
ja: 7.裁判所の判決や特許侵害の申し立て、あるいはその他の理由(特許問題に限定されな い)で、本許諾書の条件と矛盾する条件があなたに課された場合(裁判所の命令、合意、あるいはそ の他の理由による)、その条件はあなたを本許諾書の条件から免除するものではない。

source: 8. If the distribution and/or use of the Program is restricted in certain countries either by patents or by copyrighted interfaces, the original copyright holder who places the Program under this License may add an explicit geographical distribution limitation excluding those countries, so that distribution is permitted only in or among countries not thus excluded.
ja: 8.プログラムの頒布や利用が特許や著作権で保護されたインターフェイスによってある 特定の国々で制限されている場合、『プログラム』を本許諾書の下に置く原著作 権者は、そのような国々を除外する明示的な地理的頒布制限を加えることができる。

source: 8: Prompt to Create New File
ja: 8：新しいファイルを作成するかどうかを確認します

source: 9. The Free Software Foundation may publish revised and/or new versions of the General Public License from time to time.
ja: 9.フリーソフトウェア財団は、一般公衆利用許諾書の改訂版や新版を随時発行することができる。

source: ;@Ahk2Exe-ResourceID Name
ja: リソースID名前

source: nnn: A numeric code page identifier.
ja: nnn：数値のコードページ識別子。

source: ? (question mark):
ja: ?（クエスチョンマーク）：

source: ? (question mark): The hotstring will be triggered even when it is inside another word; that is, when the character typed immediately before it is alphanumeric.
ja: ?（クエスチョンマーク）：ホットストリングは、他の単語の中にあっても発動します。つまり、直前に入力された文字が英数字である場合、ホットストリングは発動します。

source: A: All members of the group will be closed.
ja: A：グループの全メンバーがクローズとなります。

source: ANSI: Each character is one byte (8 bits).
ja: ANSI：1文字が1バイト（8ビット）です。

source: Add (+) and subtract (-).
ja: 足し算（+）と引き算 (-)。

source: Add 2 to the above number to provide an edit field that allows the user to type the name of a folder.
ja: 上記数値に2を加え、フォルダー名を入力できる編集フィールドを設ける。

source: Add 4 to the above number to omit the BIF_NEWDIALOGSTYLE property.
ja: BIF_NEWDIALOGSTYLEプロパティを省略する場合は、上記数値に4を加算してください。

source: All: Apply the given WarningMode to all supported warning types.
ja: All：サポートされているすべての警告タイプに、与えられたWarningModeを適用します。

source: Allowed characters: Letters, digits, underscore and non-ASCII characters; however, only property names can begin with a digit.
ja: 使用できる文字：文字、数字、アンダースコア、非ASCII文字。ただし、数字で始めることができるのはプロパティ名のみです。

source: Allowed characters: Letters, digits, underscore and non-ASCII characters; however, the first character cannot be a digit.
ja: 使用可能な文字：文字、数字、アンダースコア、非ASCII文字。ただし、1文字目は数字にすることはできません。

source: Alt: Uses an alternate method to retrieve the color, which should be used when the normal method produces invalid or inaccurate colors for a particular type of window.
ja: Alt：色を取得するための代替方法を使用します。通常の方法では、特定のタイプのウィンドウに対して無効または不正確な色が生成される場合に使用します。

source: AltSubmit: Uses alternate submit method.
ja: AltSubmit：別の送信方法を使用します。

source: AltTab: If the alt-tab menu is visible, move forward in it.
ja: AltTab：Alt-tabメニューが表示されているときに、次のウィンドウを選択します。

source: AltTab (and others):
ja: AltTab（その他）：

source: AltTab (and others): These are special Alt-Tab hotkey actions that are described here.
ja: AltTab（その他）：これらは、ここで説明するAlt-Tabの特殊なホットキーアクションです。

source: AltTabAndMenu: If the alt-tab menu is visible, move forward in it.
ja: AltTabAndMenu：Alt-tabメニューが表示されているときに、次のウィンドウを選択します。

source: AltTabMenu: Show or hide the alt-tab menu.
ja: AltTabMenu：Alt-tabメニューを表示したり非表示にしたりします。

source: AltTabMenuDismiss: Close the Alt-tab menu.
ja: AltTabMenuDismiss：Alt-tabメニューを閉じます。

source: Alternate solutions: If your key or mouse button is not detectable by the Key History screen, one of the following might help:
ja: 別の解決策：キーまたはマウスボタンが「キー履歴」画面で検出できない場合は、次のいずれかをお試しください：

source: Alternate solutions:
ja: 代替案

source: AlwaysOff: Forces the key to stay off permanently.
ja: AlwaysOff：強制的にキーをオフのままにします。

source: AlwaysOn: Forces the key to stay on permanently.
ja: AlwaysOn：強制的にキーをオンのままにします。

source: AlwaysOnTop: Makes the window stay on top of all other windows, which is the same effect as WinSetAlwaysOnTop.
ja: AlwaysOnTop：WinSetAlwaysOnTopと同じ効果で、ウィンドウが他のすべてのウィンドウより上にあるようにします。

source: Arithmetic bit shift right (>>).
ja: 算術ビットの右シフト（>>）。

source: Array literal.
ja: 配列リテラル。

source: Assign.
ja: アサイン。

source: Assume-global mode: If a function needs to access or create a large number of global variables, it can be defined to assume that all its variables are global (except its parameters) by making its first line the word "global".
ja: アシュームグローバルモード：ある関数が多数のグローバル変数にアクセスしたり作成したりする必要がある場合、その関数の最初の行を「global」とすることで、（パラメータを除く）すべての変数がグローバルであると仮定するよう定義することができます。

source: Assume-global mode:
ja: アシュームグローバルモード。

source: Assume-static mode: A function may be defined to assume that all its undeclared local variables are static (except its parameters) by making its first line the word "static".
ja: アシュームスタティックモード：関数の最初の行を「static」とすることで、宣言されていないローカル変数はすべて（パラメータを除いて）静的であると仮定するように定義することができる。

source: Assume-static mode:
ja: アシュームスタティックモード

source: Aurelian Maga: For writing the source code for ImageSearch and the faster PixelSearch.
ja: Aurelian Maga：ImageSearchと、より高速なPixelSearchのソースコードを書いてくれた。

source: Auto: Adjusts the column's width to fit its contents.
ja: Auto：カラムの内容に合わせて、カラムの幅を調整します。

source: AutoHdr: Adjusts the column's width to fit its contents and the column's header text, whichever is wider.
ja: AutoHdr：カラムの幅を、そのコンテンツとカラムのヘッダーテキストのどちらか広い方に合うように調整します。

source: AutoHotkey 32-bit/64-bit: If an incoming parameter is intended to be 8-bit or 16-bit (or 32-bit on x64), the upper bits of the value might contain "garbage" which can be filtered out by using bitwise-and, as in the following examples:
ja: AutoHotkey 32ビット/64ビット：入力されるパラメータが8ビットまたは16ビット（x64では32ビット）の場合、値の上位ビットに「ゴミ」が含まれることがありますが、次の例のようにビットワイズアンドを使用することでフィルタリングすることができます：

source: AutoHotkey 32-bit: All incoming parameters are unsigned 32-bit integers.
ja: AutoHotkey 32ビット：入力されるパラメータはすべて符号なし32ビット整数です。

source: AutoHotkey 64-bit: All incoming parameters are signed 64-bit integers.
ja: AutoHotkey 64ビット：入力されるパラメータはすべて符号付き64ビット整数です。

source: AutoHotkey objects are instances of the Object class.
ja: AutoHotkeyオブジェクトは Objectクラスのインスタンスです。

source: AutoSize: Resizes the window to accommodate only its currently visible controls.
ja: AutoSize：現在表示されているコントロールのみを収容するためにウィンドウのサイズを変更します。

source: B0 (B followed by a zero):
ja: B0（Bの後に0がつく）。

source: B0 (B followed by a zero): Automatic backspacing is not done to erase the abbreviation you type.
ja: B0（Bの後に0がつく）：自動バックスペースは、入力した略号を消すために行うものではありません。

source: B: Sets BackspaceIsUndo to 0 (false), which causes Backspace to be ignored.
ja: B：BackspaceIsUndoを0 (false)に設定し、Backspaceを無視するようにします。

source: B or B0:
ja: B または B0:

source: B or B0: Specify the letter B to buffer the hotkey as described in #MaxThreadsBuffer.
ja: B または B0:Bを指定すると、#MaxThreadsBufferで説明したように、ホットキーをバッファリングします。

source: B or Bold:
ja: BまたはBold：

source: BSTR: If the flag is set, the BSTR is freed when the wrapper object is freed.
ja: BSTR：このフラグが設定されている場合、BSTRはラッパーオブジェクトが解放される際に解放されます。

source: Background: Specify the word Background followed immediately by a color name (see color chart) or RGB value (the 0x prefix is optional).
ja: Background：単語Backgroundの直後に、色名（カラーチャート参照）またはRGB値（接頭辞0xは任意）を指定します。

source: BackgroundColor: Changes the background color of the control.
ja: BackgroundColor：コントロールの背景色を変更します。

source: BackgroundTrans: Uses a transparent background, which allows any control that lies behind a Text, Picture, or GroupBox control to show through.
ja: BackgroundTrans：透明な背景を使用し、Text、Picture、GroupBox コントロールの後ろにあるコントロールが透けて見えるようにします。

source: BarBreak: As above, but with a dividing line between columns.
ja: BarBreak：上記と同様ですが、列の間に仕切り線があります。

source: Bit shift left (<<).
ja: ビットシフト・レフト（<<）。

source: Bitwise-and (&), bitwise-exclusive-or (^), and bitwise-or (|).
ja: ビットワイズ・アンド（&）、ビットワイズ・エクスクルーシブ・オア（^）、ビットワイズ・オア（|）。

source: Bitwise-not (~): This inverts each bit of its operand.
ja: Bitwise-not（~）：オペランドの各ビットを反転する。

source: BlockInput Compared to SendInput/SendPlay: Although the BlockInput function can be used to prevent any keystrokes physically typed by the user from disrupting the flow of simulated keystrokes, it is often better to use SendInput or SendPlay so that keystrokes and mouse clicks become uninterruptible.
ja: BlockInputとSendInput/SendPlayの比較：BlockInput関数を使用すると、ユーザーが物理的に入力したキーストロークがシミュレーションされたキーストロークの流れを中断するのを防ぐことができますが、キーストロークとマウスクリックが中断しないようにSendInputまたはSendPlayを使用する方がよい場合があります。

source: Bold: Displays the item's name in a bold font.
ja: Bold：項目名を太字で表示します。

source: Boolean values: When an expression is required to evaluate to true or false (such as an IF-statement), a blank or zero result is considered false and all other results are considered true.
ja: ブール値：IF文など式が真偽で評価される必要があるときは、空白またはゼロは偽とみなされ、それ以外の結果は真とみなされます。

source: Border: Provides a thin-line border around the control.
ja: Border：コントロールの周囲に細い線のボーダーを提供します。

source: Border: Provides a thin-line border around the window.
ja: Border：ウィンドウの周囲に細い線のボーダーを提供します。

source: Break: The item begins a new column in a popup menu.
ja: Break：ポップアップメニューの新しい列を開始する項目です。

source: Buddy1 and Buddy2:
ja: Buddy1とBuddy2：

source: Buttons: Specify -Buttons (minus Buttons) to avoid displaying a plus or minus button to the left of each item that has children.
ja: Buttons：-Buttons（マイナスButtons）を指定すると、子アイテムを持つ各アイテムの左にプラスボタンやマイナスボタンが表示されなくなります。

source: ByRef Parameters:
ja: ByRef パラメータ：

source: C0 or COff:
ja: C0またはCOff：

source: C0 or COff: Case-insensitive sort.
ja: C0またはCOff：大文字小文字を区別しないソート。

source: C1: Do not conform to typed case.
ja: C1：型番の大文字と小文字を一致させない。

source: C: Case-sensitive:
ja: C：大文字小文字を区別します：

source: C: Case-sensitive: When you type an abbreviation, it must exactly match the case defined in the script.
ja: C：大文字小文字を区別します：略語を入力するときは、スクリプトで定義されている大文字と正確に一致する必要があります。

source: C: Color name (see color chart) or RGB value -- or specify the word Default to return to the system's default color (black on most systems).
ja: C：色名（カラーチャート参照）またはRGB値 -- あるいはDefaultを指定すると、システムのデフォルトカラー（ほとんどのシステムでは黒）に戻ります。

source: C: Sets CaseSensitive to 1 (true), making MatchList case-sensitive.
ja: C：CaseSensitiveを1 (true)に設定し、MatchListの大文字小文字を区別するようにします。

source: C: Text color.
ja: C：テキストの色。

source: C or Checked:
ja: CまたはChecked：

source: C, C1 or COn:
ja: C、C1またはCOn：

source: C, C1 or COn: Case-sensitive sort (ignored if the N option is also present).
ja: C、C1またはCOn：大文字小文字を区別してソートします（Nオプションがある場合は無視されます）。

source: C, Check or Checked:
ja: C、CheckまたはChecked：

source: CDecl or C:
ja: CDecl または C：

source: CDecl or C: Makes Address conform to the "C" calling convention.
ja: CDecl または C：Addressを「C」呼び出し規則に準拠させる。

source: CL or CLocale:
ja: CLまたはCLocale：

source: CL or CLocale: Case-insensitive sort based on the current user's locale.
ja: CLまたはCLocale：現在のユーザーのロケールに基づき、大文字小文字を区別せずにソートします。

source: CLSID: The globally unique identifier (GUID) of the object's class.
ja: CLSID：オブジェクトのクラスのグローバル一意識別子（GUID）です。

source: CLogical: Like CLocale, but digits in the strings are considered as numerical content rather than text.
ja: CLogical： CLocaleと似ているが、文字列中の数字はテキストではなく数値の内容とみなされます。

source: COM objects such as those created by ComObject.
ja: ComObjectで作成されるようなCOMオブジェクト。

source: CP0 or empty string:
ja: CP0 または空文字列：

source: CP0 or empty string: The system default ANSI code page.
ja: CP0または空文字列：システムデフォルトのANSIコードページ。

source: CPnnn: A code page with numeric identifier nnn.
ja: CPnnn：数値識別子nnnを持つコードページ。

source: Caching: By default, the URL is retrieved directly from the remote server (that is, never from Internet Explorer's cache).
ja: キャッシング：デフォルトでは、URLはリモートサーバーから直接取得されます（つまり、Internet Explorerのキャッシュから取得することはありません）。

source: Caching:
ja: キャッシングです：

source: Call: The function object to call when the property is called.
ja: Call：プロパティが呼び出されたときに呼び出される関数オブジェクトです。

source: Call a method, denoted by ().
ja: ()で示されるメソッドを呼び出す。

source: Caption (present by default):
ja: Caption（デフォルトで存在します）：

source: Caption (present by default): Provides a title bar and a thick window border/edge.
ja: Caption（デフォルトで存在します）：タイトルバーと太いウィンドウのボーダー/エッジを提供します。

source: Caret: Affects CaretGetPos.
ja: Caret：CaretGetPosに影響を与えます。

source: Case sensitivity: None for ASCII characters.
ja: 大文字と小文字の区別：ASCII 文字の場合、なし。

source: Case-insensitive equal (=) / not-equal (!=) and case-sensitive equal (==) / not-equal (!==).
ja: 大文字小文字を区別しないイコール（=）/ノットイコール（=）、 大文字小文字を区別するイコール（==）/ノットイコール（!==）。

source: Case-sensitive: By default, regular expressions are case-sensitive.
ja: 大文字と小文字を区別する：デフォルトでは、正規表現は大文字と小文字を区別します。

source: Case: The sorting of the column is case-sensitive (affects only text columns).
ja: Case：カラムのソートは大文字と小文字を区別します（テキストカラムにのみ影響します）。

source: CaseLocale: The sorting of the column is case-insensitive based on the current user's locale (affects only text columns).
ja: CaseLocale：カラムのソートは、現在のユーザーのロケールに基づき、大文字と小文字を区別しません（テキストカラムにのみ影響します）。

source: Caution: This table does not apply to hotkeys.
ja: 注意：この表はホットキーには適用されません。

source: Caution: Use this only on windows which have custom items in their system menu.
ja: 注意：システムメニューにカスタム項目があるウィンドウズでのみ使用します。

source: Center: Centers the control's text within its available width.
ja: Center：コントロールのテキストを使用可能な幅の範囲内でセンタリングします。

source: Center: Centers the text in the column.
ja: Center：カラム内のテキストをセンタリングします。

source: Center: Centers the window horizontally and vertically on the screen.
ja: Center：画面上でウィンドウを縦横にセンタリングします。

source: Character: Generally, other parts of this documentation use the term "character" to mean a string's smallest unit; bytes for ANSI strings and 16-bit code units for Unicode (UTF-16) strings.
ja: 文字：一般に、この文書の他の部分では、文字列の最小単位を意味する用語「文字」を使用しています。ANSI文字列ではバイト、Unicode（UTF-16）文字列では16ビットコード単位です。

source: Characters vs. keys: By default, characters are sent by first translating them to keystrokes.
ja: キャラクターとキー：の比較：デフォルトでは、文字はまずキーストロークに変換されて送信されます。

source: Characters vs. keys:
ja: キャラクターとキーの比較：

source: Check: Shows a checkmark in the row (if the ListView has checkboxes).
ja: Check：ListViewにチェックボックスがある場合）行にチェックマークを表示します。

source: Check: Shows a checkmark to the left of the item (if the TreeView has checkboxes).
ja: Check：TreeViewにチェックボックスがある場合）アイテムの左にチェックマークを表示します。

source: Check, Checked or C:
ja: Check、CheckedまたはC：

source: Checked: Provides a checkbox at the left side of each item.
ja: Checked：各項目の左側にチェックボックスがあります。

source: Checked: Provides a checkbox at the left side of each row.
ja: チェック付き：各行の左側にチェックボックスを提供します。

source: Choose → GuiControl.Choose(n), where n is a pure integer.
ja: Choose → GuiControl.Choose(n)、ここでnは純粋な整数です。

source: Choose → GuiCtrl.Choose(n), where in is a pure integer.
ja: Choose→GuiCtrl.Choose(n), ここでinは純粋な整数です。

source: ChooseString → GuiControl.Choose(s), where s is not a pure integer.
ja: ChooseString → GuiControl.Choose(s)、ここでsは純粋な整数ではありません。

source: ChooseString → GuiCtrl.Choose(s), where s is not a pure integer.
ja: ChooseString→GuiCtrl.Choose(s), ここでsは純粋な整数ではありません。

source: Christian Sander: For developing support for SysLink controls.
ja: Christian Sander：SysLinkコントロールのサポートを開発。

source: Class: The object's class name.
ja: Class：オブジェクトのクラス名。

source: ClassNN (String):
ja: ClassNN（文字列）：

source: ClassNN (String): The ClassNN (classname and instance number) of the control, which can be determined via Window Spy.
ja: ClassNN（文字列）：コントロールのClassNN（クラス名とインスタンス番号）は、Window Spyで確認することができます。

source: Classes of characters: The square brackets enclose a list or range of characters (or both).
ja: 文字のクラス：角括弧は文字のリストまたは範囲（または両方）を囲む。

source: ClickCount: If omitted, it defaults to 1.
ja: ClickCount：省略されたときは、初期値は 1 です。

source: ClickCount: The number of times to click the mouse.
ja: ClickCount（クリックカウント）：マウスをクリックする回数を指定します。

source: Client: Coordinates are relative to the active window's client area, which excludes the window's title bar, menu (if it has a standard one) and borders.
ja: Client：座標は、アクティブウィンドウのクライアント領域（ウィンドウのタイトルバー、メニュー（標準的なものがある場合）、ボーダーを除く）からの相対座標です。

source: Col4: Returns only the fourth column (field) rather than all columns (replace 4 with a number of your choice).
ja: Col4:すべての列ではなく、4番目の列（フィールド）だけを返します（4は任意の数字に置き換えてください）。

source: Col: Specify the word Col followed immediately by the column number at which to begin applying the parameters Col1 and beyond.
ja: Col：Colの後に、パラメータCol1以降の適用を開始する列番号を指定する。

source: Col or Column:
ja: Col または Column：

source: Comma (multi-statement).
ja: コンマ（複数ステートメント）。

source: Command Line: The compiler can be run from the command line by using the parameters shown below.
ja: コマンドライン：コンパイラーは、以下に示すパラメーターを使用してコマンドラインから実行することができる。

source: Command format must use Name as the output variable (often the first parameter), e.g.
ja: コマンド・フォーマットでは、出力変数（多くの場合、最初のパラメーター）としてNameを使用しなければならない。

source: Comments (or Comment or Com or C):
ja: Comments (または Comment または Com または C)：

source: Comments (or Comment or Com or C): Allows semicolon comments inside the continuation section (but not /*..*/).
ja: Comments（または Comment または Com または C）：継続セクション内でのセミコロン・コメントを許可する（ただし/*..*/は不可）。

source: Comparing variables: Please read the expressions section below for important notes about the different kinds of comparisons.
ja: 変数の比較：さまざまな種類の比較に関する重要な注意事項については、以下の式のセクションをお読みください。

source: Concatenate.
ja: 連結。

source: Continuation by enclosure: If a line contains an expression or function/property definition with an unclosed (/[/{, it is joined with subsequent lines until the number of opening and closing symbols balances out.
ja: 囲みによる継続：ある行に式や関数・プロパティの定義があり、その定義が閉じていない(/[/{場合、開閉記号の数が釣り合うまで後続の行と結合される。

source: Continuation operator: A line that starts with a comma or any other expression operator (except ++ and --) is automatically merged with the line directly above it.
ja: 継続演算子：カンマまたはその他の式演算子（++と--を除く）で始まる行は、その直上の行に自動的にマージされる。

source: Continuation section: This method should be used to merge a large number of lines or when the lines are not suitable for the other methods.
ja: 継続セクション：この方法は、多数の行を統合する場合や、行が他の方法に適さない場合に使用する。

source: Coords: If omitted, the cursor's current position is used.
ja: Coords：省略された場合は、カーソルの現在位置が使用されます。

source: Coords: The X and Y coordinates to which the mouse cursor is moved prior to clicking.
ja: Coords（座標）：クリックする前にマウスカーソルを移動させるX、Y座標です。

source: Count Col: Returns the number of columns in the control (or -1 if the count cannot be determined).
ja: Count Col：コントロール内のカラム数を返します（カウントが確定できない場合は-1）。

source: Count Focused: Returns the row number (position) of the focused row (0 if none).
ja: Count Focused： フォーカスされた行の行番号（位置）を返します（ない場合は0）。

source: Count Selected: Returns the number of selected (highlighted) rows.
ja: Count Selected：選択されている（ハイライトされている）行の数を返します。

source: Count: Returns a single number that is the total number of rows in the ListView.
ja: Count：リストビューの行の総数を1つだけ返します。

source: Count: Specify the word Count followed immediately by the total number of rows that the ListView will ultimately contain.
ja: Count：Countの後に、ListViewが最終的に含む行の総数を指定します。

source: D: Press the mouse button down but do not release it (i.e. generate a down-event).
ja: D：マウスボタンを押しながら離さない（ダウンイベントを発生させます）。

source: D: Select Folder (Directory).
ja: D：フォルダー（ディレクトリ）を選択します。

source: D: Wait for the key to be pushed down.
ja: D：キーが押し下げられるのを待ちます。

source: Dx: Specifies x as the delimiter character, which determines where each item begins and ends.
ja: Dx：区切り文字としてxを指定し、各項目の始まりと終わりを決定する。

source: DPIScale: Use MyGui.Opt("-DPIScale") to disable DPI scaling, which is enabled by default.
ja: DPIScale：デフォルトで有効になっているDPIスケーリングを無効にするには、MyGui.Opt("-DPIScale")を使用します。

source: Declarations are optional: Except where noted on the functions page, variables do not need to be declared.
ja: 宣言は任意： 関数のページに記載がある場合を除き、変数は宣言する必要はありません。

source: Default: Turns off both the Send and the Mouse modes, but does not change the current state of input blocking.
ja: Default：送信モードとマウスモードの両方をオフにしますが、入力ブロックの現在の状態は変更しません。

source: Dereference or name substitution.
ja: デリファレンスまたは名前の置換。

source: Desc: Descending order.
ja: Desc：降順。

source: Description is optional.
ja: Descriptionは任意である。

source: Directory: Specify a directory instead of a file to alter the search strategy by all subsequent occurrences of #DllLoad which do not specify an absolute path to a DLL or EXE.
ja: ディレクトリ：DLLまたはEXEへの絶対パスを指定しない#DllLoadを実行した場合、ファイルではなくディレクトリを指定することで検索方法を変更します。

source: Directory: Specify a directory instead of a file to change the working directory used by all subsequent occurrences of #Include and FileInstall in the current file.
ja: ディレクトリ：ファイルではなくディレクトリを指定することで、それ以降に出現する現在のファイル内の#IncludeとFileInstallが使用する作業ディレクトリを変更します。

source: Disabled: Disables the window, which prevents the user from interacting with its controls.
ja: Disabled：ウィンドウを無効化し、ユーザーがそのコントロールと対話することを防ぎます。

source: Disabled: Makes an input-capable control appear in a disabled state, which prevents the user from focusing or modifying its contents.
ja: Disabled：入力可能なコントロールを無効な状態で表示させ、ユーザーがその内容に注目したり、変更したりすることを防ぎます。

source: Dn: Date options.
ja: Dn：日付の選択肢。

source: DownOrUp: This component is normally omitted, in which case each click consists of a down-event followed by an up-event.
ja: DownOrUp：このコンポーネントは通常省略され、その場合、各クリックはダウンイベントとアップイベントから構成されます。
